# Enter your network definition here.
# Use Shift+Enter to update the visualization.
name: "HFO Net"
force_backward: true
layer {
  name: "prev_s"
  type: "Input"
  top: "prev_s"
  input_param {
    shape {
      dim: 1
      dim: 59
      dim: 1
      dim: 1
    }
  }
}
layer {
  name: "prev_a"
  type: "Input"
  top: "prev_a"
  input_param {
    shape {
      dim: 1
      dim: 3
      dim: 1
      dim: 1
    }
  }
}
layer {
  name: "prev_r"
  type: "Input"
  top: "prev_r"
  input_param {
    shape {
      dim: 1
      dim: 1
      dim: 1
      dim: 1
    }
  }
}
layer {
  name: "prev_p"
  type: "Input"
  top: "prev_p"
  input_param {
    shape {
      dim: 1
      dim: 1
      dim: 1
      dim: 1
    }
  }
}
layer {
  name: "prev_v"
  type: "Input"
  top: "prev_v"
  input_param {
    shape {
      dim: 1
      dim: 1
      dim: 1
      dim: 1
    }
  }
}
layer {
  bottom: "prev_s"
  top:  "fc1"
  name: "fc1"
  type: "InnerProduct"
  inner_product_param {
    num_output: 64
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  bottom: "fc1"
  top:  "fc1"
  name: "elu1"
  type: "ELU"
}
layer {
  bottom: "fc1"
  top:  "fc2"
  name: "fc2"
  type: "InnerProduct"
  inner_product_param {
    num_output: 64
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  bottom: "fc2"
  top:  "fc2"
  name: "elu2"
  type: "ELU"
}
layer {
  bottom: "fc2"
  top:  "fea"
  name: "fea"
  type: "InnerProduct"
  inner_product_param {
    num_output: 64
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  bottom: "fea"
  top:  "fea"
  name: "elu3"
  type: "ELU"
}
layer {
  bottom: "fea"
  top:  "fc_dis_1"
  name: "fc_dis_1"
  type: "InnerProduct"
  inner_product_param {
    num_output: 32
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  bottom: "fc_dis_1"
  top:  "fc_dis_1"
  name: "elu_dis_1"
  type: "ELU"
}
layer {
  bottom: "fc_dis_1"
  top:  "fc_dis_2"
  name: "fc_dis_2"
  type: "InnerProduct"
  inner_product_param {
    num_output: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  bottom: "fea"
  top:  "fc_cnt_1"
  name: "fc_cnt_1"
  type: "InnerProduct"
  inner_product_param {
    num_output: 32
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  bottom: "fc_cnt_1"
  top:  "fc_cnt_1"
  name: "elu_cnt_1"
  type: "ELU"
}
layer {
  bottom: "fc_cnt_1"
  top:  "cnt_pred"
  name: "cnt_pred"
  type: "InnerProduct"
  inner_product_param {
    num_output: 6
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  bottom: "fea"
  top: "fc_val_1"
  name: "fc_val_1"
  type: "InnerProduct"
  inner_product_param {
    num_output: 32
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  bottom: "fc_val_1"
  top:  "fc_val_1"
  name: "elu_val_1"
  type: "ELU"
}
layer {
  bottom: "fc_val_1"
  top:  "val_pred"
  name: "val_pred"
  type: "InnerProduct"
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  bottom: "fc_dis_2"
  top:  "dis_pred"
  name: "dis_pred"
  type: "Softmax"
}
